<?php
class City_list {
        static public $list = array(
        '北京',
        '上海',
        '重庆',
        '合肥', '安庆', '蚌埠','亳州','巢湖','滁州', '阜阳','贵池', '淮北','淮化','淮南','黄山','九华山','六安','马鞍山','宿州','铜陵','屯溪','芜湖','宣城',
        '福州','福安','龙岩','南平','宁德','莆田','泉州','三明','邵武','石狮','晋江','永安','武夷山','厦门','漳州', 
        '兰州','白银','定西','敦煌','甘南','金昌','酒泉','临夏','平凉','天水','武都','武威','西峰','嘉峪关','张掖',
        '广州','潮阳','潮州','澄海', '东莞','佛山','河源','惠州','江门','揭阳','开平','茂名','梅州','清远','汕头','汕尾','韶关','深圳','顺德','阳江','英德','云浮','增城','湛江','肇庆','中山','珠海',
        '南宁','百色','北海','桂林','防城港','河池','贺州','柳州','来宾','钦州','梧州','贵港','玉林',
        '贵阳','安顺','毕节','都匀','凯里','六盘水','铜仁','兴义','玉屏','遵义', 
        '海口','三亚','五指山','琼海','儋州','文昌','万宁','东方','定安','屯昌','澄迈','临高','万宁','白沙黎族','昌江黎族','乐东黎族','陵水黎族','保亭黎族','琼中黎族','西沙群岛','南沙群岛','中沙群岛', 
        '石家庄','保定','北戴河','沧州','承德','丰润','邯郸','衡水','廊坊','南戴河','秦皇岛','唐山','新城','邢台','张家口', 
        '哈尔滨','北安','大庆','大兴安岭','鹤岗','黑河','佳木斯','鸡西','牡丹江','齐齐哈尔','七台河','双鸭山','绥化','伊春',
        '郑州','安阳','鹤壁','潢川','焦作','济源','开封','漯河','洛阳','南阳','平顶山','濮阳','三门峡','商丘','新乡','信阳','许昌','周口','驻马店',
        '香港','九龙','新界', 
        '武汉','恩施','鄂州','黄冈','黄石','荆门','荆州','潜江','十堰','随州','武穴','仙桃','咸宁','襄阳','襄樊','孝感','宜昌', 
        '长沙','常德','郴州','衡阳','怀化','吉首','娄底','邵阳','湘潭','益阳','岳阳','永州','张家界','株洲',
        '南京','常熟','常州','海门','淮安','江都','江阴','昆山','连云港','南通','启东','沭阳','宿迁','苏州','太仓','泰州','同里','无锡','徐州','盐城','扬州','宜兴','仪征','张家港','镇江','周庄',
        '南昌','抚州','赣州','吉安','景德镇','井冈山','九江','庐山','萍乡','上饶','新余','宜春','鹰潭',
        '长春','白城','白山','珲春','辽源','梅河','吉林','四平','松原','通化','延吉', 
        '沈阳','鞍山','本溪','朝阳','大连','丹东','抚顺','阜新','葫芦岛','锦州','辽阳','盘锦','铁岭','营口', 
        '澳门', 
        '呼和浩特','包头','鄂尔多斯','乌海','乌兰察布盟','通辽','赤峰','巴彦淖尔','锡林郭勒盟','呼伦贝尔','兴安盟','阿拉善盟',
        '银川','固原','中卫','石嘴山','吴忠', 
        '西宁','德令哈','格尔木','共和','海东','海晏','玛沁','同仁','玉树', 
        '济南','滨州','兖州','德州','东营','菏泽','济宁','莱芜','聊城','临沂','蓬莱','青岛','曲阜','日照','泰安','潍坊','威海','烟台','枣庄','淄博',
        '太原','长治','大同','候马','晋城','离石','临汾','宁武','朔州','忻州','阳泉','榆次','运城', 
        '西安','安康','宝鸡','汉中','渭南','商州','绥德','铜川','咸阳','延安','榆林', 
        '成都','巴中','达州','德阳','都江堰','峨眉山','涪陵','广安','广元','九寨沟','康定','乐山','泸州','马尔康','绵阳','眉山','南充','内江','攀枝花','遂宁','汶川','西昌','雅安','宜宾','自贡','资阳','阿坝','甘孜',
        '台北','基隆','台南','台中','高雄','屏东','南投','云林','新竹','彰化','苗栗','嘉义','花莲','桃园','宜兰','台东','金门','马祖','澎湖','其它', 
        '天津','和平','东丽','河东','西青','河西','津南','南开','北辰','河北','武清','红挢','塘沽','汉沽','大港','宁河','静海','宝坻','蓟县', 
        '乌鲁木齐','阿克苏','阿勒泰','阿图什','博乐','昌吉','东山','哈密','和田','喀什','克拉玛依','库车','库尔勒','奎屯','石河子','塔城','吐鲁番','伊宁',
        '拉萨','阿里','昌都','林芝','那曲','日喀则','山南', 
        '昆明','大理','保山','楚雄','大理','东川','个旧','景洪','开远','临沧','丽江','六库','潞西','曲靖','思茅','文山','西双版纳','玉溪','中甸','昭通',
        '杭州','安吉','慈溪','定海','奉化','海盐','黄岩','湖州','嘉兴','金华','临安','临海','丽水','宁波','瓯海','平湖','千岛湖','衢州','江山','瑞安','绍兴','嵊州','台州','温岭','温州','余姚','舟山'
        );

        static public $list_with_id = array(
        '北京'=>131,
        '上海'=>130,
        '重庆'=>105,
        '合肥'=>1115, '安庆'=>1122, '蚌埠'=>1117,'亳州'=>1129,'巢湖'=>1116,'滁州'=>1124, '阜阳'=>1125,'贵池', 
        '淮北'=>1120,'淮化','淮南','黄山'=>1123,'九华山','六安'=>1128,'马鞍山'=>1119,'宿州'=>1126,'铜陵'=>1121,'屯溪','芜湖'=>1116,'宣城'=>1131,

        '福州'=>1132,'福安','龙岩'=>1139,'南平'=>1138,'宁德'=>1140,'莆田'=>1134,'泉州'=>1136,'三明'=>1135,'邵武','石狮','晋江','永安','武夷山','厦门'=>1133,'漳州'=>1137, 

        '兰州'=>1258,'白银'=>1261,'定西'=>1268,'敦煌','甘南'=>1271,'金昌'=>1260,'酒泉'=>1266,'临夏'=>1270,'平凉'=>1265,'天水'=>1262,'武都','武威'=>1263,'西峰','嘉峪关'=>1259,'张掖'=>1264,'庆阳'=>1267,'陇南'=>1269,

        '广州'=>1218,'潮阳','潮州'=>1236,'澄海', '东莞'=>1234,'佛山'=>1223,'河源'=>1231,'惠州'=>1228,'江门'=>1224,'揭阳'=>1237,'开平','茂名'=>1226,'梅州'=>1229,'清远'=>1233,'汕头'=>1221,
        '汕尾'=>1230,'韶关'=>1222,'深圳'=>1219,'顺德','阳江'=>1232,'英德','云浮'=>1238,'增城','湛江'=>1225,'肇庆'=>1227,'中山'=>1235,'珠海'=>1220,

        '南宁'=>1321,'百色'=>1326,'北海'=>1334,'桂林'=>1322,'防城港'=>1333,'河池'=>1323,'贺州'=>1324,'柳州'=>1325,'来宾'=>1327,'钦州'=>1332,'梧州'=>1328,'贵港'=>1329,'玉林'=>1330,'崇左'=>1331,

        '贵阳'=>1000,'安顺'=>1003,'毕节'=>1005,'都匀','凯里','六盘水'=>1001,'铜仁'=>1004,'兴义','玉屏','遵义'=>1002,'黔西南'=>1006,'黔东南'=>1007,'黔南'=>1008,

        '海口'=>1239,'三亚'=>1240,'五指山'=>1241,'琼海'=>1242,'儋州'=>1243,'文昌'=>1244,'万宁'=>1245,'东方'=>1246,'定安'=>1247,'屯昌'=>1247,'澄迈'=>1247,
        '临高'=>1247,'万宁'=>1247,'白沙黎族'=>1247,'昌江黎族'=>1247,'乐东黎族'=>1247,'陵水黎族'=>1247,'保亭黎族'=>1247,'琼中黎族'=>1247,'西沙群岛'=>1247,'南沙群岛'=>1247,'中沙群岛'=>1247, 

        '石家庄'=>984,'保定'=>1301,'北戴河','沧州'=>1304,'承德'=>1303,'丰润','邯郸'=>1299,'衡水'=>1306,'廊坊'=>1305,'南戴河','秦皇岛'=>1298,'唐山'=>1297,'新城','邢台'=>1300,'张家口'=>1302, 

        '哈尔滨'=>1089,'北安','大庆'=>1094,'大兴安岭'=>1101,'鹤岗'=>1092,'黑河'=>1099,'佳木斯'=>1096,'鸡西'=>1091,'牡丹江'=>1098,'齐齐哈尔'=>1090,'七台河'=>1097,'双鸭山'=>1093,'绥化'=>1100,'伊春'=>1095,

        '郑州'=>1170,'安阳','鹤壁'=>1175,'潢川','焦作'=>1174,'济源','开封'=>1171,'漯河'=>1180,'洛阳'=>1172,'南阳'=>1182,'平顶山'=>1173,
        '濮阳'=>1178,'三门峡'=>1181,'商丘'=>1183,'新乡'=>1176,'信阳'=>1184,'许昌'=>1179,'周口'=>1185,'驻马店'=>1186,

        '香港'=>1309,'九龙'=>1307,'新界'=>1308,

        '武汉'=>1187,'恩施'=>1199,'鄂州'=>1194,'黄冈'=>1196,'黄石'=>1188,'荆门'=>1193,'荆州'=>1191,'潜江'=>1201,'十堰'=>1190,'随州'=>1198,'武穴','仙桃'=>1200,'咸宁'=>1197,'襄阳','襄樊'=>1189,'孝感'=>1195,'宜昌'=>1192,

        '长沙'=>1204,'常德'=>1210,'郴州'=>1213,'衡阳'=>1207,'怀化'=>1215,'吉首','娄底'=>1216,'邵阳'=>1208,'湘潭'=>1206,'益阳'=>1212,'岳阳'=>1209,'永州'=>1214,'张家界'=>1211,'株洲'=>1205,'湘西'=>1218,

        '南京'=>1102,'常熟','常州'=>1105,'海门','淮安'=>1109,'江都','江阴','昆山','连云港'=>1108,'南通'=>1107,'启东','沭阳','宿迁'=>1114,'苏州'=>1106,
        '太仓','泰州'=>1113,'同里','无锡'=>1103,'徐州'=>1104,'盐城'=>1110,'扬州'=>1111,'宜兴','仪征','张家港','镇江'=>1112,'周庄',

        '南昌'=>1141,'抚州'=>1150,'赣州'=>1147,'吉安'=>1148,'景德镇'=>1142,'井冈山','九江'=>1144,'庐山','萍乡'=>1143,'上饶'=>1151,'新余'=>1145,'宜春'=>1149,'鹰潭'=>1146,

        '长春'=>1080,'白城'=>1087,'白山'=>1085,'珲春','辽源'=>1083,'梅河','吉林'=>1081,'四平'=>1082,'松原'=>1086,'通化'=>1084,'延吉','延边'=>1088,

        '沈阳'=>1066,'鞍山'=>1068,'本溪'=>1070,'朝阳'=>1078,'大连'=>1067,'丹东'=>1071,'抚顺'=>1069,'阜新'=>1074,'葫芦岛'=>1079,'锦州'=>1072,'辽阳'=>1075,'盘锦'=>1076,'铁岭'=>1077,'营口'=>1073, 

        '澳门'=>569,

        '呼和浩特'=>1054,'包头'=>1055,'鄂尔多斯'=>1059,'乌海'=>1056,'乌兰察布'=>1062,'通辽'=>1058,'赤峰'=>1057,'巴彦淖尔'=>1061,'锡林郭勒'=>1064,'呼伦贝尔'=>1060,'兴安盟'=>1063,'阿拉善'=>1065,

        '银川'=>1281,'固原'=>1284,'中卫'=>1285,'石嘴山'=>1282,'吴忠'=>1283, 

        '西宁'=>1272,'德令哈','格尔木','共和','海东'=>1274,'海晏','玛沁','同仁','玉树'=>1279,'海北'=>1275,'黄南'=>1276,'海南'=>1277,'果洛'=>1278,'海西'=>1280,

        '济南'=>1152,'滨州'=>1167,'兖州','德州'=>1165,'东营'=>1156,'菏泽'=>1168,'济宁'=>1160,'莱芜'=>1163,'聊城'=>1166,'临沂'=>1164,'蓬莱','青岛'=>1153,
        '曲阜','日照'=>1162,'泰安'=>1161,'潍坊'=>1158,'威海'=>1159,'烟台'=>1157,'枣庄'=>1155,'淄博'=>1154,

        '太原'=>1043,'长治'=>1046,'大同'=>1044,'候马','晋城'=>1047,'离石','临汾'=>1052,'宁武','朔州'=>1048,'忻州'=>1051,'阳泉'=>1045,'榆次','运城'=>1050,'晋中'=>1049,'吕梁'=>1053,

        '西安'=>1248,'安康'=>1256,'宝鸡'=>1250,'汉中'=>1254,'渭南'=>1252,'商州','绥德','铜川'=>1249,'咸阳'=>1251,'延安'=>1253,'榆林'=>1255,'商洛'=>1257,

        '成都'=>546,'巴中'=>845,'达州'=>843,'德阳'=>831,'都江堰','峨眉山','涪陵','广安'=>842,'广元'=>835,'九寨沟','康定','乐山'=>838,'泸州'=>834,'马尔康','绵阳'=>830,'眉山'=>840,'南充'=>839,
        '内江'=>837,'攀枝花'=>833,'遂宁'=>836,'汶川','西昌','雅安'=>844,'宜宾'=>841,'自贡'=>832,'资阳'=>846,'阿坝'=>847,'甘孜'=>848,

        '台北'=>1311,'基隆'=>1312,'台南'=>1314,'台中'=>1313,'高雄','屏东','南投','云林','新竹'=>1315,'彰化','苗栗','嘉义'=>1316,'花莲','桃园','宜兰','台东','金门','马祖','澎湖','其它', 

        '天津'=>128,

        '乌鲁木齐'=>1286,'阿克苏'=>1291,'阿勒泰'=>1294,'阿图什','博乐','昌吉','东山','哈密'=>1289,'和田'=>1290,'喀什'=>1292,'克拉玛依'=>1287,'库车','库尔勒','奎屯','石河子'=>1295,'塔城'=>1293,'吐鲁番'=>1288,'伊宁',

        '拉萨'=>1025,'阿里','昌都'=>1026,'林芝'=>1031,'那曲'=>1029,'日喀则'=>1028,'山南'=>1027, 

        '昆明'=>1009,'大理','保山'=>1012,'楚雄'=>1020,'大理'=>1021,'东川','个旧','景洪','开远','临沧'=>1016,'丽江'=>1014,'六库','潞西','曲靖'=>1010,'红河'=>1018,
        '思茅','文山'=>1017,'西双版纳'=>1019,'玉溪'=>1011,'中甸','昭通'=>1013,'普洱'=>1015,'德宏'=>1022,'怒江'=>1023,'迪庆'=>1024,

        '杭州'=>723,'安吉','慈溪','定海','奉化','海盐','黄岩','湖州','嘉兴'=>761,'金华'=>788,'临安','临海','丽水'=>820,'宁波'=>737,
        '瓯海','平湖','千岛湖','衢州'=>798,'江山','瑞安','绍兴'=>775,'嵊州','台州'=>810,'温岭','温州'=>749,'余姚','舟山'=>805,'湖州'=>769
        );
}
